In [2]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns

In [3]:
df = pd.read_csv("./datasets/nba.csv")
# df.shape
df.isnull().sum()
df.dtypes

Name         object
Team         object
Number      float64
Position     object
Age         float64
Height       object
Weight      float64
College      object
Salary      float64
dtype: object

In [4]:
df["College"] = df["College"].fillna(df["College"].mode()[0])
df["Salary"] = df["Salary"].fillna(df["Salary"].mean())
df.dropna(inplace = True)

In [5]:
df.isnull().sum()

Name        0
Team        0
Number      0
Position    0
Age         0
Height      0
Weight      0
College     0
Salary      0
dtype: int64

In [6]:
height_group = df.groupby(df["Height"])
age_group = df.groupby(df["Age"])
# height_group.head()
# height_group.size()
# height_group["Salary"].mean()
# height_group["Salary"].describe()
# height_group.get_group("6-7")
age_group.size()
# age_group.dtypes

Age
19.0     2
20.0    19
21.0    19
22.0    26
23.0    41
24.0    47
25.0    45
26.0    36
27.0    41
28.0    31
29.0    28
30.0    31
31.0    22
32.0    13
33.0    14
34.0    10
35.0     9
36.0    10
37.0     4
38.0     4
39.0     2
40.0     3
dtype: int64

In [30]:
df["Age"].std()

np.float64(4.404016424405833)

In [54]:
# bins = [19,25,31,36,40]
# labels = ["19-24", "25-30", "31-35", "36-40"]
# df["AgeGroup"] = pd.cut(df["Age"], bins=bins, labels=labels)
# age_groups = df.groupby(df["AgeGroup"])
# age_groups["Salary"].describe()
# assg = age_groups.apply(list)
# assg

/tmp/ipykernel_4042/2768434576.py:4: FutureWarning: The default of observed=False is deprecated and will be changed to True in a future version of pandas. Pass observed=False to retain current behavior or observed=True to adopt the future default and silence this warning.
  age_groups = df.groupby(df["AgeGroup"])
/tmp/ipykernel_4042/2768434576.py:6: DeprecationWarning: DataFrameGroupBy.apply operated on the grouping columns. This behavior is deprecated, and in a future version of pandas the grouping columns will be excluded from the operation. Either pass `include_groups=False` to exclude the groupings or explicitly select the grouping columns after groupby to silence this warning.
  assg = age_groups.apply(list)

AgeGroup
19-24    [Name, Team, Number, Position, Age, Height, We...
25-30    [Name, Team, Number, Position, Age, Height, We...
31-35    [Name, Team, Number, Position, Age, Height, We...
36-40    [Name, Team, Number, Position, Age, Height, We...
dtype: object

In [14]:
df.select_dtypes(include='number').median()[0:4]

Number         13.0
Age            26.0
Weight        220.0
Salary    2869440.0
dtype: float64

In [8]:
df.groupby(['Age'])['Salary'].mean()

Age
19.0    1.930440e+06
20.0    2.725791e+06
21.0    2.067380e+06
22.0    2.357963e+06
23.0    2.171719e+06
24.0    3.830295e+06
25.0    3.951130e+06
26.0    6.866566e+06
27.0    6.632008e+06
28.0    5.101559e+06
29.0    6.174838e+06
30.0    6.990272e+06
31.0    8.511397e+06
32.0    7.716958e+06
33.0    3.930739e+06
34.0    7.606030e+06
35.0    3.615178e+06
36.0    2.238120e+06
37.0    1.079400e+07
38.0    1.840041e+06
39.0    2.517872e+06
40.0    4.666917e+06
Name: Salary, dtype: float64

In [63]:
df.groupby(['Age'])['Salary'].min()

Age
19.0    1733040.0
20.0     525093.0
21.0     525093.0
22.0     525093.0
23.0      30888.0
24.0     525093.0
25.0      55722.0
26.0     134215.0
27.0      55722.0
28.0     206192.0
29.0     111444.0
30.0     947276.0
31.0     947276.0
32.0     295327.0
33.0     200600.0
34.0     261894.0
35.0     947276.0
36.0     947276.0
37.0    5000000.0
38.0     222888.0
39.0     947726.0
40.0     250750.0
Name: Salary, dtype: float64

In [16]:
data = pd.read_csv("./datasets/iris.csv")
data.head()

   sepal_length  sepal_width  petal_length  petal_width species
0           5.1          3.5           1.4          0.2  setosa
1           4.9          3.0           1.4          0.2  setosa
2           4.7          3.2           1.3          0.2  setosa
3           4.6          3.1           1.5          0.2  setosa
4           5.0          3.6           1.4          0.2  setosa

In [17]:
data.tail()

     sepal_length  sepal_width  petal_length  petal_width    species
145           6.7          3.0           5.2          2.3  virginica
146           6.3          2.5           5.0          1.9  virginica
147           6.5          3.0           5.2          2.0  virginica
148           6.2          3.4           5.4          2.3  virginica
149           5.9          3.0           5.1          1.8  virginica

In [18]:
data[data["species"] == "setosa"].describe()

       sepal_length  sepal_width  petal_length  petal_width
count      50.00000    50.000000     50.000000     50.00000
mean        5.00600     3.418000      1.464000      0.24400
std         0.35249     0.381024      0.173511      0.10721
min         4.30000     2.300000      1.000000      0.10000
25%         4.80000     3.125000      1.400000      0.20000
50%         5.00000     3.400000      1.500000      0.20000
75%         5.20000     3.675000      1.575000      0.30000
max         5.80000     4.400000      1.900000      0.60000

In [19]:
data[data["species"] == "versicolor"].describe()

       sepal_length  sepal_width  petal_length  petal_width
count     50.000000    50.000000     50.000000    50.000000
mean       5.936000     2.770000      4.260000     1.326000
std        0.516171     0.313798      0.469911     0.197753
min        4.900000     2.000000      3.000000     1.000000
25%        5.600000     2.525000      4.000000     1.200000
50%        5.900000     2.800000      4.350000     1.300000
75%        6.300000     3.000000      4.600000     1.500000
max        7.000000     3.400000      5.100000     1.800000

In [20]:
data[data["species"] == "virginica"].describe()

       sepal_length  sepal_width  petal_length  petal_width
count      50.00000    50.000000     50.000000     50.00000
mean        6.58800     2.974000      5.552000      2.02600
std         0.63588     0.322497      0.551895      0.27465
min         4.90000     2.200000      4.500000      1.40000
25%         6.22500     2.800000      5.100000      1.80000
50%         6.50000     3.000000      5.550000      2.00000
75%         6.90000     3.175000      5.875000      2.30000
max         7.90000     3.800000      6.900000      2.50000

In [21]:
data[data["species"] == "setosa"].min()

sepal_length       4.3
sepal_width        2.3
petal_length       1.0
petal_width        0.1
species         setosa
dtype: object

In [22]:
data[data["species"] == "setosa"].max()

sepal_length       5.8
sepal_width        4.4
petal_length       1.9
petal_width        0.6
species         setosa
dtype: object